; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v13 ?v12)
             (pred_4 ?v11 ?v8)
             (pred_9 ?v13 ?v8)
             (pred_10 ?v9 ?v13 )
	     (pred_6 ?v13)
             (pred_8 ?v4)
             (pred_11 ?v11)
             (pred_1 ?v8)
             (pred_12 ?v13)
             (pred_7 ?v11)
             (pred_5 ?v13)
             (pred_3 ))



(:action op_4
:parameters (?v7 ?v2 ?v6 ?v10)
:precondition (and (pred_8 ?v7) (pred_8 ?v2) (pred_11 ?v6) (pred_1 ?v10)
          (pred_2 ?v7 ?v2) (pred_4 ?v6 ?v10)
                   (pred_9 ?v2 ?v10) (pred_6 ?v7) 
                   (pred_12 ?v2) (pred_7 ?v6))
:effect (and  (pred_5 ?v2) (not (pred_12 ?v2))))


(:action op_2
:parameters (?v7 ?v5)
:precondition (and (pred_8 ?v7) (pred_8 ?v5)
               (pred_6 ?v7) (pred_2 ?v7 ?v5) (pred_5 ?v5))
:effect (and (pred_6 ?v5) (not (pred_6 ?v7))))

(:action op_1
:parameters (?v7 ?v6)
:precondition (and (pred_8 ?v7) (pred_11 ?v6) 
                  (pred_6 ?v7) (pred_10 ?v6 ?v7) (pred_3 ))
:effect (and (pred_7 ?v6)
   (not (pred_10 ?v6 ?v7)) (not (pred_3 ))))


(:action op_5
:parameters (?v7 ?v1 ?v3)
:precondition (and (pred_8 ?v7) (pred_11 ?v1) (pred_11 ?v3)
                  (pred_6 ?v7) (pred_7 ?v3) (pred_10 ?v1 ?v7))
:effect (and (pred_7 ?v1) (pred_10 ?v3 ?v7)
        (not (pred_7 ?v3)) (not (pred_10 ?v1 ?v7))))

(:action op_3
:parameters (?v7 ?v6)
:precondition (and (pred_8 ?v7) (pred_11 ?v6) 
                  (pred_6 ?v7) (pred_7 ?v6))
:effect (and (pred_3 ) (pred_10 ?v6 ?v7) (not (pred_7 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_01 obj_21 obj_03 obj_22 obj_02 obj_20 obj_14 obj_19 obj_16 obj_08 obj_18 obj_10 obj_11 obj_06 obj_07
    obj_04 obj_05 obj_15
    obj_12 obj_09 obj_13
    )

    (:init
       (pred_3)

       (pred_8 obj_17)
       (pred_8 obj_01)
       (pred_8 obj_21)
       (pred_8 obj_03)
       (pred_8 obj_22)
       (pred_8 obj_02)
       (pred_8 obj_20)
       (pred_8 obj_14)
       (pred_8 obj_19)
       (pred_8 obj_16)
       (pred_8 obj_08)
       (pred_8 obj_18)
       (pred_8 obj_10)
       (pred_8 obj_11)
       (pred_8 obj_06)
       (pred_8 obj_07)
       (pred_1 obj_04)
       (pred_1 obj_05)
       (pred_1 obj_15)
       (pred_11 obj_12)
       (pred_11 obj_09)
       (pred_11 obj_13)

       (pred_2 obj_17 obj_22)
       (pred_2 obj_17 obj_01)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_01 obj_21)
       (pred_2 obj_01 obj_17)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_21 obj_03)
       (pred_2 obj_21 obj_01)
       (pred_2 obj_03 obj_14)
       (pred_2 obj_03 obj_21)
       (pred_2 obj_22 obj_19)
       (pred_2 obj_22 obj_02)
       (pred_2 obj_22 obj_17)
       (pred_2 obj_02 obj_16)
       (pred_2 obj_02 obj_20)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_02 obj_22)
       (pred_2 obj_20 obj_08)
       (pred_2 obj_20 obj_14)
       (pred_2 obj_20 obj_21)
       (pred_2 obj_20 obj_02)
       (pred_2 obj_14 obj_18)
       (pred_2 obj_14 obj_03)
       (pred_2 obj_14 obj_20)
       (pred_2 obj_19 obj_10)
       (pred_2 obj_19 obj_16)
       (pred_2 obj_19 obj_22)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_16 obj_08)
       (pred_2 obj_16 obj_02)
       (pred_2 obj_16 obj_19)
       (pred_2 obj_08 obj_06)
       (pred_2 obj_08 obj_18)
       (pred_2 obj_08 obj_20)
       (pred_2 obj_08 obj_16)
       (pred_2 obj_18 obj_07)
       (pred_2 obj_18 obj_14)
       (pred_2 obj_18 obj_08)
       (pred_2 obj_10 obj_11)
       (pred_2 obj_10 obj_19)
       (pred_2 obj_11 obj_06)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_11 obj_10)
       (pred_2 obj_06 obj_07)
       (pred_2 obj_06 obj_08)
       (pred_2 obj_06 obj_11)
       (pred_2 obj_07 obj_18)
       (pred_2 obj_07 obj_06)
       (pred_12 obj_21)
       (pred_12 obj_16)
       (pred_12 obj_19)
       (pred_9  obj_21 obj_04)
       (pred_9  obj_16 obj_05)
       (pred_9  obj_19 obj_15)
       (pred_5 obj_17)
       (pred_5 obj_01)
       (pred_5 obj_03)
       (pred_5 obj_22)
       (pred_5 obj_02)
       (pred_5 obj_20)
       (pred_5 obj_14)
       (pred_5 obj_08)
       (pred_5 obj_18)
       (pred_5 obj_10)
       (pred_5 obj_11)
       (pred_5 obj_06)
       (pred_5 obj_07)

       (pred_4  obj_12 obj_04)
       (pred_4  obj_09 obj_05)
       (pred_4  obj_13 obj_15)
       (pred_10 obj_12 obj_22)
       (pred_10 obj_09 obj_02)
       (pred_10 obj_13 obj_11)
       (pred_6 obj_17)
    )

    (:goal (and
       (pred_10 obj_13 obj_22)
    ))
(:constraints
  (always (not (pred_6 obj_19)))
)
)

; plan
1. (op_2 obj_17 obj_22)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_22)
   goals met: 0 of 1
2. (op_2 obj_22 obj_02)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_02)
   goals met: 0 of 1
3. (op_1 obj_02 obj_09)
   deleted: (pred_10 obj_09 obj_02) (pred_3)
   added: (pred_7 obj_09)
   goals met: 0 of 1
4. (op_4 obj_02 obj_16 obj_09 obj_05)
   deleted: (pred_12 obj_16)
   added: (pred_5 obj_16)
   goals met: 0 of 1
5. (op_2 obj_02 obj_16)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_16)
   goals met: 0 of 1
6. (op_2 obj_16 obj_11)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_11)
   goals met: 0 of 1
7. (op_5 obj_11 obj_13 obj_09)
   deleted: (pred_7 obj_09) (pred_10 obj_13 obj_11)
   added: (pred_7 obj_13) (pred_10 obj_09 obj_11)
   goals met: 0 of 1
8. (op_2 obj_11 obj_16)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_16)
   goals met: 0 of 1
9. (op_2 obj_16 obj_02)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_02)
   goals met: 0 of 1
10. (op_2 obj_02 obj_22)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_22)
   goals met: 0 of 1
11. (op_5 obj_22 obj_12 obj_13)
   deleted: (pred_7 obj_13) (pred_10 obj_12 obj_22)
   added: (pred_7 obj_12) (pred_10 obj_13 obj_22)
   goals met: 1 of 1
